{
    "description": "**Drug Summary: Mercaptopurine 50 mg**\n\n- **Description:** A yellow, round pill imprinted with \"9 3 5510,\" identified as Mercaptopurine 50 mg, supplied by Teva Pharmaceuticals USA. Used primarily in treating Acute Lymphoblastic Leukemia, Mercaptopurine is categorized as an antimetabolite. It poses a positive risk for human fetuses during pregnancy and is not classified as a controlled substance.\n\n- **Drug Interactions:**\n  - **Major Interactions:** Humira (adalimumab), Remicade (infliximab)\n  - **Moderate Interactions:** Apriso, Asacol, Lialda, Pentasa (all containing mesalamine)\n\n- **Side Effects:**\n  - **More Common:** Black, tarry stools; bleeding gums; clay-colored stools; cough; dark urine; decreased appetite; fever; headache; nausea; painful urination; pale skin; rash; stomach pain; swelling in legs; unusual bleeding; yellow skin/eyes.\n  - **Less Common:** Darkening of the skin.\n  - **Incidence Not Known:** Hair loss; low sperm count. \n\nPatients using Mercaptopurine should be monitored closely for these side effects and interactions.",
    "interactions": {
        "major interactions": {
            "Humira (adalimumab)": "Humira is a medication used to treat conditions like arthritis and certain skin issues. It helps reduce pain and swelling by calming the immune system. It’s usually given as an injection under the skin. Side effects can include injection site reactions or increased risk of infections, so it’s important to talk to your doctor if you notice anything unusual. Always follow your doctor's instructions while using this medication.",
            "Remicade (infliximab)": "Remicade is a medicine that helps reduce inflammation in conditions like arthritis or certain bowel diseases. It works by calming the immune system, which can help improve your comfort and ability to move around. You may receive it through an IV in a doctor's office or clinic. It’s important to follow your doctor’s instructions and attend follow-up appointments to monitor your health while on this treatment."
        },
        "moderate interactions": {
            "Apriso (mesalamine)": "Apriso is a medicine that helps treat inflammation in the intestines, often used for conditions like ulcerative colitis. It works to reduce symptoms such as stomach pain and diarrhea. You usually take it once a day, and it's important to take it consistently to feel better. Make sure to drink plenty of water and inform your doctor if you have any unusual side effects. Always follow your doctor's advice on how to take it.",
            "Asacol (mesalamine)": "Asacol is a medication used to help treat and manage inflammation in the intestines, often for conditions like ulcerative colitis. It works by reducing inflammation and helping you feel better. It's important to take it as prescribed, and you may notice improvements in your symptoms over time. Make sure to tell your doctor if you have any side effects or if your symptoms don’t improve.",
            "Lialda (mesalamine)": "Lialda is a medication used to help manage a condition called ulcerative colitis, which affects the intestines. It helps reduce inflammation, easing symptoms like stomach pain and diarrhea. You take it as a pill, usually once a day, with a full glass of water. It's important to follow your doctor's instructions and let them know if you have any side effects. Staying hydrated and maintaining a balanced diet can also help while using this medication.",
            "Pentasa (mesalamine)": "Pentasa is a medicine used to help treat inflammation in your intestines. It can relieve symptoms like pain and diarrhea due to conditions like ulcerative colitis. You’ll usually take it in tablet form, and it’s important to follow your doctor’s instructions. Make sure to drink plenty of water and report any unusual side effects. This treatment can help you feel more comfortable and improve your daily life."
        }
    },
    "sideEffects": {
        "More common side effects": [
            "black, tarry stools",
            "bleeding gums",
            "clay colored stools",
            "cough or hoarseness",
            "dark urine",
            "decreased appetite",
            "fever or chills",
            "headache",
            "loss of appetite",
            "lower back or side pain",
            "nausea,vomiting",
            "painful or difficult urination",
            "pale skin",
            "pinpoint red spots on the skin",
            "rash,itchy skin",
            "stomach pain or tenderness",
            "swelling of the feet or lower legs",
            "trouble with breathing upon exertion",
            "unusual bleeding or bruising",
            "unusual tiredness or weakness",
            "yellow eyes or skin"
        ],
        "Less common side effects": [
            "darkening of the skin"
        ],
        "Incidence not known": [
            "hair lossor thinning of the hair",
            "low sperm count"
        ]
    }
}